Revit 2026 API

# InitialIlluminanceIntensity(InitialIlluminanceIntensity) Constructor

---

Creates a copy of the given initial illuminance intensity object

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public InitialIlluminanceIntensity(
	InitialIlluminanceIntensity other
)
```
```vb
Public Sub New (
	other As InitialIlluminanceIntensity
)
```
```cpp
public:
InitialIlluminanceIntensity(
	InitialIlluminanceIntensity^ other
)
```
```fsharp
new :
        other : InitialIlluminanceIntensity -> InitialIlluminanceIntensity
```

#### Parameters

other InitialIlluminanceIntensity

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

InitialIlluminanceIntensity Class

InitialIlluminanceIntensity Overload

Autodesk.Revit.DB.Lighting Namespace